# RebarBendingDetailFailures Properties

---
The BuiltInFailuresRebarBendingDetailFailures type exposes the following members.
| Name| Description
---|---|---
| RemoveBendingDetailWithInvalidRebarElement|  The reinforcement element is no longer supporting bending details. The associated bending detail elements have been deleted.
Top
#### Reference
BuiltInFailuresRebarBendingDetailFailures Class
Autodesk.Revit.DB Namespace